
//-підсвічування гравця чия черга виконати хід 
//-підсвічування актуальної позиції гравця на ігровому полі

let player21=[
    5,  /*1 гуманітарна допомога Зх Україна (картка: 5) 
            -купівля об'єкту
                -списання вартості об'єкту з гравця на рахунок банку
                -встановлення орендної плати об'єкту у його вартості 
                -підсвічування поля вартості об'єкту у колір гравця*/
    11, /*2 гуманітарна допомога Пд Україна (картка: 16) 
            -купівля 2го об'єкту такого ж типу
                -(купівля об'єкту)
                -перерахунок орендної плати враховуючи наявну кількість об'єктів даного типу у власності
                -встановлення перерахованої орендної плати у вартості обєкту для всіх об'єктів даного типу що знаходяться у власності*/
    12, /*3 донат ЗСУ (картка: 28)
            -донат на ЗСУ
            -списання номіналу донату з гравця на рахунок банку*/
    8,  /*4 гуманітарна допомога Сх Україна (картка: 36)
            -потрапляння на вже занятий об'єкт, коли є декілька власників з таким типом об'єкту
                -списання актуальної вартості оренди об'єкту з гравця саме відповідно власника і його кількості об'єктів у власності з даним типом*/
    1,  /*5 Шанс (картка: 37)
            -ще раз
            !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/           
    3,  /*6 Старт (картка: 0)
            -бонус за пройдене коло гри
                -списання розміру бонусу з банку на рахунок гравця*/
    4,  /*7 Міська скарбниця (картка: 4)
            -!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
    1,  /*8 гуманітарна допомога Зх Україна (картка: 5)
            -потрапляння на власний об'єкт
                -купівля об'єкту чи аукціон не пропонуються
                -виводиться повідомлення про власний об'єкт*/
    5,  /*9 Бункер (картка: 10)
                -!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
    20, /*10 в'язниця (картка: 30)
                -відмова від ходу за рахунок бункера (зайнятий об'єкт з великою вартістю оренди)*/
    20, /*11 в'язниця (картка: 30)
            -внесення застави 
                -списання номіналу застави з гравця на рахунок банку*/
    1,  /*12 Постачання ППО (картка: 31)
            -хід дозволений після внесення застави
            -(купівля об'єкту)*/
    2,  /*13 ЗСУ ТРО (картка: 33)
            -(купівля об'єкту)*/
    2,  /*14 Волонтерська організація (картка: 35)
            -відмова від купівлі об'єкту
                -об'єкт виставляється на аукціон
                    -!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!проводиться аукціон*/ 
    
    /*8,  /*12 Чорнобаївка (картка: 38)
            -(пропуск гравцем наступного ходу гри)*/           
    /*0,  /*13 буде пропуск ходу (картка: -)
            -(пропуск гравцем 1го ходу з 1го)*/
    /*1,  /*14 Стратегічний об'єкт острів Зміїний (картка: 39)
            -відмова від купівлі об'єкту
                -об'єкт виставляється на аукціон
                    -!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!проводиться аукціон*/     
];
let player22=[
    5,  /*1 гуманітарна допомога Зх Україна (картка: 5)
            -потрапляння на вже занятий об'єкт
                -списання вартості оренди об'єкту з гравця на рахунок гравця-власника об'єкту*/
    11, /*2 гуманітарна допомога Пд Україна (картка: 16)
            -потрапляння на вже занятий об'єкт, коли у його власника декілька об'єктів даного типу
                -списання актуальної вартості оренди об'єкту з гравця відповідно кількості об'єктів у власника*/
    20,  /*3 гуманітарна допомога сх Україна (картка: 36)
            -купівля об'єкту, коли об'єкт такого ж типу вже є у власності іншого гравця
                -(купівля об'єкту)
                -встановлення орендної плати об'єкту саме у відношенні цього власника*/
    1,  /*4 Шанс (картка: 37)
            -!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
    1,  /*5 Чорнобаївка (картка: 38)
            -пропуск гравцем наступного ходу гри*/ 
    0,  /*6 буде пропуск ходу (картка: -)
            -пропуск гравцем 1го ходу з 1го*/
    6,  /*7 Міська скарбниця (картка: 4)
            -ще раз !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/   
    6,  /*8 Бункер (картка: 10)
            -!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
    6, /*9 гуманітарна допомога Пд Україна (картка: 16)
            -НЕвідмова від ходу за рахунок бункера (зайнятий об'єкт з великою вартістю оренди)*/
    4, /*10 Лотерея (картка: 20)
            -!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/ 
    10, /*11 в'язниця (картка: 30)
            -пропуск гравцем 2х наступних ходів гри*/ 
    0,  /*12 буде пропуск ходу (картка: -)
            -пропуск гравцем 1го ходу з 2х*/
    0,  /*13 буде пропуск ходу (картка: -)
            -пропуск гравцем 2го ходу з 2х*/
    5,  /*14 Волонтерська організація (картка: 35)
            -купівля об'єкту недостатньо коштів
                -об'єкт виставляється на аукціон
                    -!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!проводиться аукціон*/
];



export let TestStepsScenario=[];

TestStepsScenario.push(player21,player22)


export let GameRound=0;
export function GameRoundIncrement(){
    GameRound=GameRound+1; 
}


